# -*- coding = utf-8 -*-
# @Time : 2021/8/21 8:24
# @Author : 陈凡亮
# @File : Profits.py
# @Software : PyCharm

def main():
    n= int(input())
    if n<=100000:
        print(int(n*0.1))
    elif n<=200000:
        print(int(10000+(n-10000)*0.075))
    elif n<=400000:
        print(int(100000*0.1+100000*0.75+(n-200000)*0.05))
    elif n<=600000:
        print(int(100000*0.1+100000*0.75+200000*0.5+(n-400000)*0.03))
    elif n<=1000000:
        print(int(100000 * 0.1 + 100000 * 0.75 + 200000 * 0.5 +200000*0.3+ (n - 600000) * 0.015))
    else:
        print(int(100000 * 0.1 + 100000 * 0.75 + 200000 * 0.5 +200000*0.3+ 400000*0.015+(n - 1000000) * 0.001))

if __name__ == "__main__":
    main()
